app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "price", "description", "kol", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "car"], ["price", 100000.0], ["description", "very good car"], ["kol", 1], ["created_at", "2015-01-29 20:14:33.088560"], ["updated_at", "2015-01-29 20:14:33.088560"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "avatar_updated_at" = ?, "avatar_file_name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["avatar_updated_at", "2015-02-01 10:31:41.299589"], ["avatar_file_name", "clipart39.png"], ["updated_at", "2015-02-01 10:31:41.375145"], ["id", 3]]